Revit 2026 API

# MEPSystemRemove(ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual void Remove(
	ICollection<ElementId> elementIds
)
```
```vb
Public Overridable Sub Remove (
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
virtual void Remove(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
abstract Remove :
        elementIds : ICollection<ElementId> -> unit
override Remove :
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

elementIds ICollectionElementId

#### Reference

MEPSystem Class

Remove Overload

Autodesk.Revit.DB Namespace